; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v1 - type_2 ?v2 - type_3)
 	      (pred_4 ?v5 - object ?v2 - type_3)
	      (pred_3 ?v1 - type_2 ?v7 - type_1)
	      (pred_2 ?v1 - type_2 ?v5 - object ?v7 - type_1))

   (:action op_2
       :parameters  (?v1 - type_2 ?v3 ?v4 - type_3)
       :precondition (and  (pred_1 ?v1 ?v3))
       :effect (and  (pred_1 ?v1 ?v4)
		     (not (pred_1 ?v1 ?v3))))

   (:action op_3
       :parameters (?v1 - type_2 ?v8 - object ?v6 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_4 ?v8 ?v6) (pred_1 ?v1 ?v6) (pred_3 ?v1 ?v7))
       :effect (and (pred_2 ?v1 ?v8 ?v7)
		    (not (pred_4 ?v8 ?v6)) 
		    (not (pred_3 ?v1 ?v7))))

   (:action op_1
       :parameters (?v1 - type_2 ?v8 - object ?v6 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_2 ?v1 ?v8 ?v7) (pred_1 ?v1 ?v6))
       :effect (and (pred_4 ?v8 ?v6)
		    (pred_3 ?v1 ?v7)
		    (not (pred_2 ?v1 ?v8 ?v7)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_10 obj_07 - type_2
obj_04 obj_05 obj_02 obj_08 - type_1
obj_03 obj_01 obj_06 - type_3
obj_12 obj_09 obj_11 - object)
(:init
(pred_1 obj_10 obj_01)
(pred_3 obj_10 obj_04)
(pred_3 obj_10 obj_05)
(pred_1 obj_07 obj_06)
(pred_3 obj_07 obj_02)
(pred_3 obj_07 obj_08)
(pred_4 obj_12 obj_03)
(pred_4 obj_09 obj_06)
(pred_4 obj_11 obj_06)
)
(:goal
(and
(pred_4 obj_12 obj_06)
(pred_4 obj_09 obj_03)
(pred_4 obj_11 obj_06)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_10 obj_06) (pred_1 obj_07 obj_06))))
  )
)
)

; plan
1. (op_2 obj_10 obj_01 obj_03)
   deleted: (pred_1 obj_10 obj_01)
   added: (pred_1 obj_10 obj_03)
   goals met: 1 of 3
2. (op_3 obj_07 obj_09 obj_06 obj_08)
   deleted: (pred_4 obj_09 obj_06) (pred_3 obj_07 obj_08)
   added: (pred_2 obj_07 obj_09 obj_08)
   goals met: 1 of 3
3. (op_3 obj_10 obj_12 obj_03 obj_05)
   deleted: (pred_4 obj_12 obj_03) (pred_3 obj_10 obj_05)
   added: (pred_2 obj_10 obj_12 obj_05)
   goals met: 1 of 3
4. (op_2 obj_07 obj_06 obj_03)
   deleted: (pred_1 obj_07 obj_06)
   added: (pred_1 obj_07 obj_03)
   goals met: 1 of 3
5. (op_1 obj_07 obj_09 obj_03 obj_08)
   deleted: (pred_2 obj_07 obj_09 obj_08)
   added: (pred_4 obj_09 obj_03) (pred_3 obj_07 obj_08)
   goals met: 2 of 3
6. (op_2 obj_10 obj_03 obj_06)
   deleted: (pred_1 obj_10 obj_03)
   added: (pred_1 obj_10 obj_06)
   goals met: 2 of 3
7. (op_1 obj_10 obj_12 obj_06 obj_05)
   deleted: (pred_2 obj_10 obj_12 obj_05)
   added: (pred_4 obj_12 obj_06) (pred_3 obj_10 obj_05)
   goals met: 3 of 3
